
// Имя процедуры указываем свое!!!
// Крч, сделали команду и копируйте внутрь то, что обрамлено в  [LINUX*******]


// ЗАДАНИЕ 1 ВРЕМЕНА ГОДА
// Перед этим создайте перечисление с языками, чтобы потом можно было к ним обращаться в коде

&НаСервере
Процедура ВременаГодаНаСервере()
	Если Объект.язык = Перечисления.язык.английский Тогда
		Сообщить("Winter Spring Summer Autumun");
	КонецЕсли;
	Если Объект.язык = Перечисления.язык.русский Тогда
		Сообщить("Зима Весна Лето Осень");
	КонецЕсли;
	Если Объект.язык = Перечисления.язык.татарский Тогда
		Сообщить("Кыш Яз Жэй Коз");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВременаГода1(Команда)
	ВременаГодаНаСервере();
КонецПроцедуры




// ЗАДАНИЕ 2 ИНТЕРАКТИВНЫЙ МАССИВ
// СОЗДАЕМ ТОЛЬКО НА КЛИЕНТЕ!!! (По дефолту) Иначе ввестизначение не будет работать!

&НаКлиенте
Процедура ЗаполнитьМассивСамому()
  
  // КОПИРУЕМ ОТСЮДА
	МассивЮзера = Новый массив(Объект.Размерность);
	
	Для Индекс = 0 по (Объект.Размерность - 1)
	Цикл
		ВвестиЗначение(МассивЮзера[Индекс], "Введите " + (Индекс + 1) + " - ое число", Тип("Число"));
	КонецЦикла;
	Сообщить("Вы ввели в массив следующее");
	
	Для Индекс = 0 по (Объект.Размерность - 1) Цикл
		Сообщить("" + (Индекс + 1) + " число = " + МассивЮзера[Индекс]);
	КонецЦикла;
	
	самыйбольшой = МассивЮзера[0];
	сбиндекс = 0;
	Для Индекс = 1 по (Объект.Размерность - 1) Цикл
		Если МассивЮзера[Индекс] > самыйбольшой Тогда
			самыйбольшой = МассивЮзера[Индекс];
			сбиндекс = Индекс;
		КонецЕсли;
	КонецЦикла;
	Сообщить("Самый большой элемент массива = " + самыйбольшой);
	Сообщить("Его индекс = " + сбиндекс)
  // КОПИРУЕМ ДОСЮДА

КонецПроцедуры
