// СОЗДАЕМ ТОЛЬКО НА КЛИЕНТЕ!!! (По дефолту)
// Имя процедуры указываем свое!!!
// Крч, сделали команду и копируйте внутрь то, что обрамлено в  [LINUX*******]

&НаКлиенте
Процедура ЗаполнитьМассивСамому()
  
  // КОПИРУЕМ ОТСЮДА
	МассивЮзера = Новый массив(Объект.Размерность);
	
	Для Индекс = 0 по (Объект.Размерность - 1)
	Цикл
		ВвестиЗначение(МассивЮзера[Индекс], "Введите " + (Индекс + 1) + " - ое число", Тип("Число"));
	КонецЦикла;
	Сообщить("Вы ввели в массив следующее");
	
	Для Индекс = 0 по (Объект.Размерность - 1) Цикл
		Сообщить("" + (Индекс + 1) + " число = " + МассивЮзера[Индекс]);
	КонецЦикла;
	
	самыйбольшой = МассивЮзера[0];
	сбиндекс = 0;
	Для Индекс = 1 по (Объект.Размерность - 1) Цикл
		Если МассивЮзера[Индекс] > самыйбольшой Тогда
			самыйбольшой = МассивЮзера[Индекс];
			сбиндекс = Индекс;
		КонецЕсли;
	КонецЦикла;
	Сообщить("Самый большой элемент массива = " + самыйбольшой);
	Сообщить("Его индекс = " + сбиндекс)
  // КОПИРУЕМ ДОСЮДА

КонецПроцедуры
